app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
<script type="application/json" id="bootstrapped_posts_json">
  <%= Post.all.to_json.html_safe %>