app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "asdf"], ["created_at", Tue, 01 Oct 2013 18:49:41 UTC +00:00], ["title", "asdf"], ["updated_at", Tue, 01 Oct 2013 18:49:41 UTC +00:00]]